#include<iostream>
#include<string> 
using namespace std;
int main()
{
	//設定答案
	int ans=8462;
	 
	//初始介面設定
	cout<<"----------------------------"<<endl;
	cout<<"| ～歡迎來到幾Ａ幾Ｂ遊戲～ |"<<endl;
	cout<<"|                          |"<<endl; 
	cout<<"|         Player:          |"<<endl; 
	cout<<"|                          |"<<endl; 
	cout<<"|     請先輸入遊戲ID       |"<<endl; 
	cout<<"|                          |"<<endl; 
	cout<<"----------------------------"<<endl; 
	
	//玩家設定
	string p1;
	cout<<"\n輸入您的遊戲ID:";
	cin>>p1; 
	cout<<"\n遊戲ID已設置完成\n\n";
	
	//簡易遊戲說明 
	cout<<"以下為遊戲規則\n\n";
	cout<<"------------------------------------------------------------\n\n"; 
	cout<<"請玩家輸入一個四位數字，當輸入數字後會有ｘＡｙＢ的遊戲提示，\n\n";
	cout<<"其中Ａ代表數字正確位置也正確，而Ｂ代表數字正確但位置不正確，\n\n";
	cout<<"當猜玩家遇到困難，也就是猜測過多次數字也無法好好的利用線索的\n\n";
	cout<<"話，系統則會開始給玩家提示，以利玩家輸入正確的答案。\n\n\n"; 
	cout<<"現在遊戲開始！\n\n";
		
	//答案設定以及計數器設定 
	int c=0,d=0,count=0;
	int a[4];
	a[0]=ans/1000;
	a[1]=ans%1000/100;
	a[2]=ans%100/10;
	a[3]=ans%10;
	
	//計數迴圈設定 
	for(int count=1;count>0;count++)
		{	
			//判斷是否已達給提示次數 
			if(count==11)
				{
					cout<<"親愛的玩家"<<p1<<"：\n"; 
					cout<<"由於您已經猜了10次仍未猜中答案，\n";
					cout<<"所以系統決定給你四位數字的千位數\n";
					cout<<"字，也就是  ８  \n\n";
				}
				
			if(count==21)
				{
					cout<<"親愛的玩家"<<p1<<"：\n"; 
					cout<<"由於您已經猜了20次仍未猜中答案，\n";
					cout<<"所以系統決定給你四位數字的百位數\n";
					cout<<"字，也就是  ４  \n\n";
				}
				
			if(count==31)
				{
					cout<<"親愛的玩家"<<p1<<"：\n"; 
					cout<<"由於您已經猜了30次仍未猜中答案，\n";
					cout<<"所以系統決定給你四位數字的十位數\n";
					cout<<"字，也就是  ６  \n\n";
				}
				
			if(count==41)
				{
					cout<<"親愛的玩家"<<p1<<"：\n"; 
					cout<<"由於您已經猜了40次仍未猜中答案，\n";
					cout<<"所以系統決定給你四位數字的個位數\n";
					cout<<"字，也就是  ２  \n\n";
					cout<<"期待您下次能早點答出正確答案，歡\n";
					cout<<"迎再度遊玩～\n\n";
					break;
				}		
						 							 							 								
			//給玩家信心喊話一下 
			cout<<"現在玩家"<<p1<<"已經猜了"<<count-1<<"次，請加油！\n\n"; 
			cout<<"請輸入數字N:";
			
			//輸入測試答案設定 
			int test=0;
			cin>>test;
			int b[4];
			b[0]=test/1000;
			b[1]=test%1000/100;
			b[2]=test%100/10;
			b[3]=test%10;
			
			//AB判斷 
			for(int j=0;j<4;j++)
				{
					if(b[j]==a[0]||b[j]==a[1]||b[j]==a[2]||b[j]==a[3])
						c++;
					if(b[j]==a[j])
						{
							c--;
							d++;
						} 
				}
			cout<<"\n"<<d<<"A"<<c<<"B\n\n";			
			c=0;
			d=0;
			if(test==8462)
				{
					cout<<"答案正確！！\n\n";
					cout<<"恭喜"<<p1<<"猜對了正確答案\n\n";
					cout<<"期待您下次再度遊玩～\n\n"; 
					break;
				}
		}
	cout<<"　　　　　　　遊戲結束　　　　　　　\n\n";
	return 0;
} 
